dimitarm1/stm_flash_prj/STM32F0_Discovery_IO_Toggle/src/main.c
		}
	}
	else
	{
		if(start_counter){
			if(state == state_show_hours){
				start_counter--;
				if(!start_counter){
					state = state_show_time;
				}
			}
			else if(state >= state_enter_service){
				if(state == state_enter_service){
					state = service_mode + state_enter_service;
				}
				start_counter--;
				if(!start_counter){
					state = state_show_time;
				}
			}
			else {
				start_counter = 0;

			}
		}
		if(prev_status != curr_status){
			if (prev_status == STATUS_WAITING && curr_status == STATUS_WORKING){
				work_hours[2]+=time_to_set;
				if(work_hours[2]>59){
					work_hours[2]=work_hours[2]-60;
					work_hours[1]++;
					if(work_hours[1]>99){
						work_hours[1] = 0;
						work_hours[0]++;
					}
				}
				write_eeprom();
				time_to_set = 0;
				percent_clima = 0, percent_licevi = 100, percent_fan1 = 0, percent_fan2 = 100;
				zero_crossed = 0;
				set_lamps(100);
				set_licevi_lamps(percent_licevi);
				set_fan1(percent_fan1);
				set_fan2(percent_fan2);
				set_clima(percent_clima);
			}
			if (curr_status == STATUS_COOLING){
				percent_licevi = 0, percent_fan1 = 100, percent_fan2 = 100;
				set_lamps(0);
				set_licevi_lamps(percent_licevi);
				set_fan1(percent_fan1);
				set_fan2(percent_fan2);
				set_clima(percent_clima);
			}
			if (curr_status == STATUS_FREE){
				percent_clima = 0, percent_licevi = 0, percent_fan1 = 0, percent_fan2 = 0;
				set_lamps(0);
				set_licevi_lamps(percent_licevi);
				set_fan1(percent_fan1);
				set_fan2(percent_fan2);
				set_clima(percent_clima);
				minute_counter = 0;
			}
			prev_status = curr_status;

		}
		//    LED1_OFF;
	}
}



/**
 * @brief  Add a delay using the Systick
 * @param  nTime Delay in milliseconds.
 * @retval None
 */
void SystickDelay(__IO uint32_t nTime)
{

	Gv_SystickCounter = nTime;
	while (Gv_SystickCounter != 0)
	{
		// The Gv_SystickCounter variable is decremented every ms by the Systick interrupt routine
	}

}

void update_status(void){
	if(pre_time) {
		curr_time = pre_time;
		curr_status = STATUS_WAITING;
	}
	else if(main_time) {
		curr_time = main_time;
		curr_status = STATUS_WORKING;
	}
	else if(cool_time) {
		curr_time = cool_time;
		curr_status = STATUS_COOLING;
	}
	else {
		curr_time = 0;
		curr_status = STATUS_FREE;
	}
}
void TimingDelay_Decrement(void)
{
	static int current_button_read = 0;
	if (Gv_SystickCounter != 0x00)
	{
		Gv_SystickCounter--;
	}
	if( ++ refresh_counter>200){
		refresh_counter = 0;
		flash_counter++;
		if(auto_exit_fn)
		{
			auto_exit_fn--;
			if (!auto_exit_fn);
		}
	}
	if(Gv_miliseconds++>60000){
		Gv_miliseconds = 0;
		if (pre_time)pre_time--;
		else if (main_time) {
			main_time--;
			minute_counter ++;
		}
		else if (cool_time) cool_time--;
		update_status();
	}
	if  (Gv_UART_Timeout){
		 Gv_UART_Timeout--;
		 if(! Gv_UART_Timeout) {
			 rx_state = 0;
			 pre_time_sent = 0, main_time_sent = 0, cool_time_sent = 0;
		 }
	}
	if(++led_counter>3){
		led_counter = 0;
		digit_num++;
		flash_counter++;
//		aqua_fresh_level = 0;
		if(digit_num>4) {
			digit_num = 0;
			last_button = current_button_read;
			current_button_read = 0;
		}
		GPIOA->BSRR = GPIO_BSRR_BR_0 | GPIO_BSRR_BR_1 | GPIO_BSRR_BR_2|GPIO_BSRR_BR_8 | GPIO_BSRR_BR_11 | GPIO_BSRR_BR_12; // Turn off the lights while changing them
		GPIOC->BSRR = GPIO_BSRR_BR_10 | GPIO_BSRR_BR_13 ;
		GPIOF->BSRR = GPIO_BSRR_BR_1 ;
		GPIOA->BSRR = GPIO_BSRR_BR_8 | GPIO_BSRR_BR_11 | GPIO_BSRR_BR_12;
		if(digit_num<3){
			show_digit(((display_data & 0xFFF)& (0x0F<<(digit_num*4)))>>(digit_num*4));
		} else {
			show_digit(0x8);// DEBUG

		}
		if(flash_mode < 3 ||(flash_counter & 0x40)){

			// Indicate pre_time by movind bars
			if (pre_time){
				volume_level = (flash_counter>>5) & 0x07;
				fan_level = ((flash_counter>>5) & 0x07) +3;
			}
			else {
				volume_level = 1;
				fan_level = 1;
			}

			switch (digit_num){
			case 0:
				GPIOA->BSRR = GPIO_BSRR_BS_2 ;
				//set Aqua 2 LED
				if(aqua_fresh_level>0){
					GPIOA->BSRR = GPIO_BSRR_BS_8 | GPIO_BSRR_BS_11 | GPIO_BSRR_BS_12;
					GPIOC->BSRR = GPIO_BSRR_BS_10 ;
				}
				current_button_read |= ((!!(GPIOC->IDR & GPIO_IDR_11)) | ((!!(GPIOC->IDR & GPIO_IDR_12))<<1) | \
						((!!(GPIOD->IDR & GPIO_IDR_2))<<2))<<0;
				break;

			case 1:
				GPIOA->BSRR = GPIO_BSRR_BS_1 ;
				//set Aqua 2 LEDs
				if(aqua_fresh_level>1){
					GPIOA->BSRR = GPIO_BSRR_BS_8 | GPIO_BSRR_BS_11 | GPIO_BSRR_BS_12;
					GPIOC->BSRR = GPIO_BSRR_BS_10 ;
				}
				current_button_read |= ((!!(GPIOC->IDR & GPIO_IDR_11)) | ((!!(GPIOC->IDR & GPIO_IDR_12))<<1) | \
										((!!(GPIOD->IDR & GPIO_IDR_2))<<2))<<4;

				break;
			case 2:
				GPIOA->BSRR = GPIO_BSRR_BS_0 ;
				//set Aqua 1 LEDs
				if(aqua_fresh_level>1){
					GPIOA->BSRR = GPIO_BSRR_BS_11 | GPIO_BSRR_BS_12;
				}
				current_button_read |= ((!!(GPIOC->IDR & GPIO_IDR_11)) | ((!!(GPIOC->IDR & GPIO_IDR_12))<<1) | \
														((!!(GPIOD->IDR & GPIO_IDR_2))<<2))<<8;
				break;
			case 3:
				GPIOC->BSRR = GPIO_BSRR_BS_13 ;
				show_level(volume_level);

				break;
			case 4:
			default:
				GPIOF->BSRR = GPIO_BSRR_BS_1 ;
				show_level(fan_level);
				break;
			}
		}
		if (((flash_mode == 1)&& digit_num == 0 && (flash_counter & 0x40)) || ((flash_mode == 2) && (digit_num == 2))){
			GPIOA->BSRR = GPIO_BSRR_BS_6 | GPIO_BSRR_BS_5;
		}
	}
	IWDG_ReloadCounter(); //DEBUG


}


void read_eeprom(void){
	int index = 0;
	flash_struct *flash_mem;
	while((eeprom_array[index]!=0xFFFFFFFFUL)&&(index<512))index+=2;
	if(index == 0){
		// Load defaults
		flash_mem = 0;
		preset_pre_time = 7;
		preset_cool_time = 3;
		work_hours[0] = 0;
		work_hours[1] = 0;
		work_hours[2] = 0;
		return;
	}
	index-=2;
	flash_mem = (flash_struct*)&eeprom_array[index];
	preset_pre_time = flash_mem->settings.pre_time ;
	preset_cool_time = flash_mem->settings.cool_time;
	work_hours[0] = flash_mem->time.hours_h;
	work_hours[1] = flash_mem->time.hours_l;
	work_hours[2] = flash_mem->time.minutes;
}

void write_eeprom(void){
	int index = 0;
	FLASH_Unlock();
	volatile flash_struct flash_mem;
	uint32_t *p = (uint32_t *)&flash_mem;
	while((eeprom_array[index]!=0xFFFFFFFFUL)&&(index<512))index+=2;
	if(index == 512){
		// No more room. Erase the 4 pages
		FLASH_ErasePage((uint32_t)&eeprom_array[0]);
		FLASH_ErasePage((uint32_t)&eeprom_array[128]);
		FLASH_ErasePage((uint32_t)&eeprom_array[256]);
		FLASH_ErasePage((uint32_t)&eeprom_array[384]);
		index = 0;
	}

	while((eeprom_array[index]!=0xFFFFFFFFUL)&&(index<512))index++;
	if(index == 512){
		display_data = 0xE01;
		for (index = 0; index<20; index++){
		}
	} else {

		flash_mem.settings.pre_time = preset_pre_time;
		flash_mem.settings.cool_time = preset_cool_time;
		flash_mem.settings.addresse = controller_address;
		flash_mem.settings.unused = 0x55;
		flash_mem.time.hours_h = work_hours[0];
		flash_mem.time.hours_l = work_hours[1];
		flash_mem.time.minutes = work_hours[2];
		flash_mem.time.used_flag = 0;
		FLASH_ProgramWord((uint32_t)&eeprom_array[index],p[0]);
		FLASH_ProgramWord((uint32_t)&eeprom_array[index+1],p[1]);
		index = sizeof(flash_mem);
		index ++;
	}
	//	FLASH_Lock();
}
void set_lamps(int value){
//	while(!zero_crossed);
	if (value)	GPIOC->BSRR = GPIO_BSRR_BS_8;
	else GPIOC->BRR = GPIO_BSRR_BS_8;
}
void set_licevi_lamps(int value){
//	while(!zero_crossed);
	if (value)	GPIOB->BSRR = GPIO_BSRR_BS_14;
	else GPIOB->BRR = GPIO_BSRR_BS_14;
}
void set_fan2(int value){
//	while(!zero_crossed);
	if (value)	GPIOC->BSRR = GPIO_BSRR_BS_14;
	else GPIOC->BRR = GPIO_BSRR_BS_14;
}
void set_fan1(int value){
	uint32_t tim_base=5;
	TIM_Cmd(TIM3, DISABLE);

